|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [4]:
import os
os.listdir(os.getcwd()) #list files in the directory and if titanic data set is present

['.ipynb_checkpoints',
 'AssignmentTitanic1Pandas-TRY.ipynb',
 'AssignmentTitanic1Pandas.ipynb',
 'AssignmentTitanic1PandasSolution.ipynb',
 'AustraliaImmigrantsPandas.ipynb',
 'Complete_Pandas_Classwork.ipynb',
 'Pandas_Practice1.ipynb',
 'Pandas_Practice2.ipynb',
 'Pandas_Practice3.ipynb',
 'titanic_dataset.csv']

In [11]:
#SET1
# Read data and describe it
import pandas as pd
df=pd.read_csv("titanic_dataset.csv")
print(df.describe())

        Unnamed: 0       pclass     survived          age        sibsp  \
count  1309.000000  1309.000000  1309.000000  1046.000000  1309.000000
mean    654.000000     2.294882     0.381971    29.881135     0.498854
std     378.020061     0.837836     0.486055    14.413500     1.041658
min       0.000000     1.000000     0.000000     0.166700     0.000000
25%     327.000000     2.000000     0.000000    21.000000     0.000000
50%     654.000000     3.000000     0.000000    28.000000     0.000000
75%     981.000000     3.000000     1.000000    39.000000     1.000000
max    1308.000000     3.000000     1.000000    80.000000     8.000000

             parch        body
count  1309.000000  121.000000
mean      0.385027  160.809917
std       0.865560   97.696922
min       0.000000    1.000000
25%       0.000000   72.000000
50%       0.000000  155.000000
75%       0.000000  256.000000
max       9.000000  328.000000

In [12]:
print(df.describe(include='all'))

         Unnamed: 0       pclass     survived                  name gender  \
count   1309.000000  1309.000000  1309.000000                  1309   1309
unique          NaN          NaN          NaN                  1307      2
top             NaN          NaN          NaN  Connolly, Miss. Kate   male
freq            NaN          NaN          NaN                     2    843
mean     654.000000     2.294882     0.381971                   NaN    NaN
std      378.020061     0.837836     0.486055                   NaN    NaN
min        0.000000     1.000000     0.000000                   NaN    NaN
25%      327.000000     2.000000     0.000000                   NaN    NaN
50%      654.000000     3.000000     0.000000                   NaN    NaN
75%      981.000000     3.000000     1.000000                   NaN    NaN
max     1308.000000     3.000000     1.000000                   NaN    NaN

                age        sibsp        parch    ticket    fare        cabin  \
count   1046.000000  1309.000000  1309.000000      1309    1308          295
unique          NaN          NaN          NaN       929     263          186
top             NaN          NaN          NaN  CA. 2343  $8.05   C23 C25 C27
freq            NaN          NaN          NaN        11      60            6
mean      29.881135     0.498854     0.385027       NaN     NaN          NaN
std       14.413500     1.041658     0.865560       NaN     NaN          NaN
min        0.166700     0.000000     0.000000       NaN     NaN          NaN
25%       21.000000     0.000000     0.000000       NaN     NaN          NaN
50%       28.000000     0.000000     0.000000       NaN     NaN          NaN
75%       39.000000     1.000000     0.000000       NaN     NaN          NaN
max       80.000000     8.000000     9.000000       NaN     NaN          NaN

       embarked boat        body     home.dest
count      1307  486  121.000000           745
unique        3   27         NaN           369
top           S   13         NaN  New York, NY
freq        914   39         NaN            64
mean        NaN  NaN  160.809917           NaN
std         NaN  NaN   97.696922           NaN
min         NaN  NaN    1.000000           NaN
25%         NaN  NaN   72.000000           NaN
50%         NaN  NaN  155.000000           NaN
75%         NaN  NaN  256.000000           NaN
max         NaN  NaN  328.000000           NaN

In [23]:
# Find columns with missingdata
print(df.isnull()) # where ever its printed true has nan/null values
print()
print()
print()
print()
print(df.isnull().any())  #gives the list of column names that

      Unnamed: 0  pclass  survived   name  gender    age  sibsp  parch  \
0          False   False     False  False   False  False  False  False
1          False   False     False  False   False  False  False  False
2          False   False     False  False   False  False  False  False
3          False   False     False  False   False  False  False  False
4          False   False     False  False   False  False  False  False
...          ...     ...       ...    ...     ...    ...    ...    ...
1304       False   False     False  False   False  False  False  False
1305       False   False     False  False   False   True  False  False
1306       False   False     False  False   False  False  False  False
1307       False   False     False  False   False  False  False  False
1308       False   False     False  False   False  False  False  False

      ticket   fare  cabin  embarked   boat   body  home.dest
0      False  False  False     False  False   True      False
1      False  False  False     False  False   True      False
2      False  False  False     False   True   True      False
3      False  False  False     False   True  False      False
4      False  False  False     False   True   True      False
...      ...    ...    ...       ...    ...    ...        ...
1304   False  False   True     False   True  False       True
1305   False  False   True     False   True   True       True
1306   False  False   True     False   True  False       True
1307   False  False   True     False   True   True       True
1308   False  False   True     False   True   True       True

[1309 rows x 15 columns]




Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [17]:
print(df.isna().any()) #same as isnull

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

In [27]:
print(df.columns[df.isna().any()]) #these columns have null values

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [33]:
print(df.columns[df.isnull().any()]) #same result as isna 
print()

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [29]:
# Print shape of dataset
print(df.shape)

(1309, 15)

In [196]:
print(df.shape[0]) #shape[0]-gives the number of rows values
print(df.shape[1]) #shape[1]-gives the number of column values

1309
8

In [56]:
# drop columns with more than 25% missing data
#dropna 
# SYNTAX : DataFrame.dropna(self, axis=0, how='any', thresh=None, subset=None, inplace=False)

df.dropna(axis='columns',thresh=df.shape[0]*0.75,inplace=True) 
print(df.columns)

#shape[0]-number of rows ,if 75% of the data in the rows are missing then remove those columns
#4 columns are removed

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

In [57]:
#  df.dropna(axis='columns',thresh=df.shape[0]*0.90) 

#if 90% percent of the data is missing then remove column
#5 columns are removed

In [73]:
# drop columns having independent values(which do not affect the survival rate)

# df.drop(columns = ['Unnamed: 0','name','ticket'], inplace=True) ------->drop only drops columns

print(df)

      pclass  survived  gender      age  sibsp  parch      fare embarked
0          1         1  female  29.0000      0      0  $211.34         S
1          1         1    male   0.9167      1      2  $151.55         S
2          1         0  female   2.0000      1      2  $151.55         S
3          1         0    male  30.0000      1      2  $151.55         S
4          1         0  female  25.0000      1      2  $151.55         S
...      ...       ...     ...      ...    ...    ...       ...      ...
1304       3         0  female  14.5000      1      0   $14.45         C
1305       3         0  female      NaN      1      0   $14.45         C
1306       3         0    male  26.5000      0      0    $7.23         C
1307       3         0    male  27.0000      0      0    $7.23         C
1308       3         0    male  29.0000      0      0    $7.88         S

[1309 rows x 8 columns]

In [78]:
#SET2
# check data types of all columns
print(df.dtypes)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

In [142]:
# convert price to numeric
print(df['fare'])

# Syntax:DataFrame.replace(self, to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')
df.fare.replace(r'\$'," ",regex=True)

0       $211.34
1       $151.55
2       $151.55
3       $151.55
4       $151.55
          ...
1304     $14.45
1305     $14.45
1306      $7.23
1307      $7.23
1308      $7.88
Name: fare, Length: 1309, dtype: object

0        211.34
1        151.55
2        151.55
3        151.55
4        151.55
          ...
1304      14.45
1305      14.45
1306       7.23
1307       7.23
1308       7.88
Name: fare, Length: 1309, dtype: object

In [112]:
# df.fare.replace(r'\$',"cat",regex=True)

0       cat 211.34
1       cat 151.55
2       cat 151.55
3       cat 151.55
4       cat 151.55
           ...
1304     cat 14.45
1305     cat 14.45
1306      cat 7.23
1307      cat 7.23
1308      cat 7.88
Name: fare, Length: 1309, dtype: object

In [116]:
# find columns still having missing/na values and also count of missing data

print(df.isnull().any())

pclass      False
survived    False
gender      False
age          True
sibsp       False
parch       False
fare         True
embarked     True
dtype: bool

In [117]:
print(df.isnull().sum())

pclass        0
survived      0
gender        0
age         263
sibsp         0
parch         0
fare          1
embarked      2
dtype: int64

In [129]:
#fill na with mean for fare and age column 

# SYNTAX:DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)

x=df.age.mean()
print(x)
print()
print(df['age'])
df.age.fillna(x,inplace=True)
print()
print(df['fare'])
df.fare.fillna(x,inplace=True)

29.8811345124283

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1304    14.5000
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
Name: age, Length: 1309, dtype: float64

0       $211.34
1       $151.55
2       $151.55
3       $151.55
4       $151.55
          ...
1304     $14.45
1305     $14.45
1306      $7.23
1307      $7.23
1308      $7.88
Name: fare, Length: 1309, dtype: object

In [144]:
# drop na values for embarked column.
print(df['embarked'])
print()
print(df.shape)
# df.drop(columns=['embarked']) #from 8 columns to 7 colums after removal of embarked

#drop-drops columns
#dropna-drops rows or columns based on the null values

# Drop Syntax:DataFrame.drop(self, labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
# Drop na Synatx:DataFrame.dropna(self, axis=0, how='any', thresh=None, subset=None, inplace=False)
df.dropna(subset=['embarked'])

0       S
1       S
2       S
3       S
4       S
       ..
1304    C
1305    C
1306    C
1307    C
1308    S
Name: embarked, Length: 1309, dtype: object

(1309, 8)

      pclass  survived  gender        age  sibsp  parch      fare embarked
0          1         1  female  29.000000      0      0  $211.34         S
1          1         1    male   0.916700      1      2  $151.55         S
2          1         0  female   2.000000      1      2  $151.55         S
3          1         0    male  30.000000      1      2  $151.55         S
4          1         0  female  25.000000      1      2  $151.55         S
...      ...       ...     ...        ...    ...    ...       ...      ...
1304       3         0  female  14.500000      1      0   $14.45         C
1305       3         0  female  29.881135      1      0   $14.45         C
1306       3         0    male  26.500000      0      0    $7.23         C
1307       3         0    male  27.000000      0      0    $7.23         C
1308       3         0    male  29.000000      0      0    $7.88         S

[1307 rows x 8 columns]

In [145]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered.csv')

In [155]:
# for surviced column replace 0 with D and 1 with A

df.survived.replace(0,'D',inplace=True) 
df.survived.replace(1,'A',inplace=True)
print(df['survived'])

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

In [157]:
# find the frequency of different values in survived column

print(df.survived.unique())
print()
print(df.survived.value_counts())

['A' 'D']

D    809
A    500
Name: survived, dtype: int64

In [164]:
# group by gender and survived and see the counts in each category
print(df)
print()
z=df.groupby(['gender','survived'])
z.count()

      pclass survived  gender        age  sibsp  parch      fare embarked
0          1        A  female  29.000000      0      0  $211.34         S
1          1        A    male   0.916700      1      2  $151.55         S
2          1        D  female   2.000000      1      2  $151.55         S
3          1        D    male  30.000000      1      2  $151.55         S
4          1        D  female  25.000000      1      2  $151.55         S
...      ...      ...     ...        ...    ...    ...       ...      ...
1304       3        D  female  14.500000      1      0   $14.45         C
1305       3        D  female  29.881135      1      0   $14.45         C
1306       3        D    male  26.500000      0      0    $7.23         C
1307       3        D    male  27.000000      0      0    $7.23         C
1308       3        D    male  29.000000      0      0    $7.88         S

[1309 rows x 8 columns]

                 pclass  age  sibsp  parch  fare  embarked
gender survived
female A            339  339    339    339   339       337
       D            127  127    127    127   127       127
male   A            161  161    161    161   161       161
       D            682  682    682    682   682       682

In [171]:
# find different pclass and no of people in each class
print(df.pclass.unique())
print(df.pclass.value_counts())

[1 2 3]
3    709
1    323
2    277
Name: pclass, dtype: int64

In [186]:
# find top 5 people with highest values of age. Count no of male and females in the top 5

#SYNTAX:DataFrame.sort(columns=None, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', **kwargs)
m=(df.sort_values('age',ascending=False))
k=(m.head(n=5))
print(k.gender.value_counts())

male      4
female    1
Name: gender, dtype: int64
['female' 'male']
male      843
female    466
Name: gender, dtype: int64

In [195]:
# find max age male and female who survived
print(df['survived']) #survived column
print()
print(df.survived.value_counts()) #alive and dead counts
print()
 
#STEP1:Display Alive counts

#STEP2:Display male and female Alive counts
#STEP3:max age of males alive
#STEP4:max age of females alive

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

D    809
A    500
Name: survived, dtype: int64

In [189]:
# get average age by gender
print(df.groupby('gender').age.mean())

gender
female    28.886935
male      30.430716
Name: age, dtype: float64

In [188]:
# get average age by people survived vs not-survived
print(df.groupby('survived').age.mean())

survived
A    29.058812
D    30.389368
Name: age, dtype: float64